// Задача 52. Задайте двумерный массив из целых чисел. Найдите среднее арифметическое элементов в каждом столбце.

// Например, задан массив:
// 1 4 7 2
// 5 9 2 3
// 8 4 2 4
// Среднее арифметическое каждого столбца: 4,6; 5,6; 3,6; 3.

double [,] myArr = {
      {1,4,7,2},
      {5,9,2,3},
      {8,4,2,4},
};

Console.Write("Среднее арифметическое каждого столбца: ");

for (int j = 0; j < myArr.GetLength(1); j++)

        {
            double average = 0;

          for (int i = 0; i < myArr.GetLength(0); i++)

           {

           average = average + (myArr[i, j]);
            
           }

           

        Console.Write($"{Math.Floor((Math.Round(average/3, 2))*10)/10}; ");
        }